app/controllers/predictions_controller.rb

SELECT "predictions".* FROM "predictions"
---
  def index
    @predictions = Prediction.all

SELECT "predictions".* FROM "predictions" WHERE "predictions"."id" = ? LIMIT 1  [["id", "4"]]
---
  def show
    @prediction = Prediction.find(params[:id])

INSERT INTO "predictions" ("created_at", "deadline", "email", "prediction", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @prediction = Prediction.new(params[:prediction])
    respond_to do |format|
      if @prediction.save